# NewProjectTemplateDocument Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewProjectTemplateDocument Method
Application Class See Also
---
New project template document
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual Document NewProjectTemplateDocument(
	string templateFilename
)
```

Visual Basic
---
```text
Public Overridable Function NewProjectTemplateDocument ( _
	templateFilename As String _
) As Document
```

Visual C++
---
```text
public:
virtual Document^ NewProjectTemplateDocument(
	String^ templateFilename
)
```

# ### Parameters
templateFilename
    Type: System..::..StringThe template file name.
# Remarks
This command corresponds to New->Project->Project Template command in the user-interface.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | If 'templateFileName' is nullNothingnullptra null reference (Nothing in Visual Basic) or an empty string. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If the project template document cannot be created. |

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace